from django.urls import path
from . import views

# ==================================================
# اسم التطبيق (Namespace)
# هذا الملف خاص بمسارات الحسابات فقط
# ويتم ربطه من المشروع الرئيسي تحت:
# /accounts/
# ==================================================
app_name = 'accounts'


urlpatterns = [

    # ==================================================
    # إنشاء حساب
    # الرابط النهائي: /accounts/register/
    # ==================================================
    path(
        'register/',
        views.register_view,
        name='register'
    ),

    # ==================================================
    # تسجيل الدخول
    # الرابط النهائي: /accounts/login/
    # ==================================================
    path(
        'login/',
        views.login_view,
        name='login'
    ),

    # ==================================================
    # تسجيل الخروج
    # الرابط النهائي: /accounts/logout/
    # ==================================================
    path(
        'logout/',
        views.logout_view,
        name='logout'
    ),

    # ==================================================
    # الملف الشخصي
    # الرابط النهائي: /accounts/profile/
    # ==================================================
    path(
        'profile/',
        views.profile_view,
        name='profile'
    ),

]
